CRenderTarget.DrawText(ATL.CStringT&lt;System.Char,StrTraitMFC_DLL&lt;System.Char&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,CD2DRectF!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,CD2DBrush*,CD2DTextFormat*,D2D1_DRAW_TEXT_OPTIONS,DWRITE_MEASURING_MODE)
Draws the specified text using the format information provided by an IDWriteTextFormat object.
strText: A pointer to an array of Unicode characters to draw.
stringLength: The number of characters in string.
rect: The size and position of the area in which the text is drawn.
pForegroundBrush: The brush used to paint the text.
textFormat: An object that describes formatting details of the text to draw, such as the font, the font size, and flow direction.
options: A value that indicates whether the text should be snapped to pixel boundaries and whether the text should be clipped to the layout rectangle. The default value is D2D1_DRAW_TEXT_OPTIONS_NONE, which indicates that text should be snapped to pixel boundaries and it should not be clipped to the layout rectangle.
measuringMode: A value that indicates how glyph metrics are used to measure text when it is formatted. The default value is DWRITE_MEASURING_MODE_NATURAL.

CRenderTarget.COLORREF_TO_D2DCOLOR(System.UInt32!System.Runtime.CompilerServices.IsLong,System.Int32)
Converts GDI color and alpha values to the D2D1_COLOR_F object.
color: RGB value.
color: Alpha value.
Returns:
D2D1_COLOR_F value.